src/cf/Reports/Отсутствия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>Отсутствия</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Содержит сотрудников на определенных должностях в структурных единицах.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата, с которой запись о сотруднике считается действительной. </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Comment>Дата, с которой запись о сотруднике считается недействительной. </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Занимаемая сотрудником должность.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииИПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВДокументах</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВПереписке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжностиПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжностиПодразделенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжностиПодразделенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Reports/Отсутствия/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура-обработчик события ПриКомпоновкеРезультата. Устанавливает цвета диаграмм.
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрСчитатьДниОтсутствия = Настройки.ПараметрыДанных.Элементы.Найти("СчитатьДниОтсутствия");
	ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПодразделениеДней = Настройки.ПараметрыДанных.Элементы.Найти("ПодразделениеДней");
	
	// Макет компоновки.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Внешние наборы данных.
	ТаблицаДниОтсутствия = Новый ТаблицаЗначений;
	ТаблицаДниОтсутствия.Колонки.Добавить("ПодразделениеДней");
	ТаблицаДниОтсутствия.Колонки.Добавить("СотрудникДней");
	ТаблицаДниОтсутствия.Колонки.Добавить("РабочихДней");
	ТаблицаДниОтсутствия.Колонки.Добавить("РаботалВОбычномРежиме");
	ТаблицаДниОтсутствия.Колонки.Добавить("РаботалУдаленно");
	ТаблицаДниОтсутствия.Колонки.Добавить("Отсутствовал");
	Если ПараметрСчитатьДниОтсутствия.Значение Тогда
		
		СотрудникиОтбора = ?(ПараметрПодразделениеДней.Использование,
			Сотрудники.СотрудникиПодразделения(ПараметрПодразделениеДней.Значение, Истина, Истина),
			Сотрудники.ВсеСотрудники());
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Сотрудники.Ссылка КАК Сотрудник,
			|	Сотрудники.Подразделение КАК Подразделение
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.Ссылка В (&СотрудникиОтбора)");
		
		Запрос.УстановитьПараметр("СотрудникиОтбора", СотрудникиОтбора);
		
		НастройкиПроверкиОтсутствий = ОтсутствияКлиентСервер.НастройкиПроверкиОтсутствий();
		НастройкиПроверкиОтсутствий.УчитыватьФлагБудуРазбиратьЗадачи = Ложь;
		
		РабочиеДниПоГрафикам = Новый Соответствие;
		ПризнакиЭтоУдаленнаяРабота = Новый Соответствие;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Подразделение) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДниОтсутствия = ТаблицаДниОтсутствия.Добавить();
			СтрокаДниОтсутствия.СотрудникДней = Выборка.Сотрудник;
			СтрокаДниОтсутствия.ПодразделениеДней = Выборка.Подразделение;
			
			ГрафикРаботыСотрудника = ГрафикиРаботы.ГрафикРаботыСотрудника(Выборка.Сотрудник);
			Если ЗначениеЗаполнено(ГрафикРаботыСотрудника) Тогда
				Если РабочиеДниПоГрафикам[ГрафикРаботыСотрудника] = Неопределено Тогда
					РабочиеДниПоГрафикам[ГрафикРаботыСотрудника] = Новый Соответствие;
				КонецЕсли;
				РабочиеДниГрафика = РабочиеДниПоГрафикам[ГрафикРаботыСотрудника];
			Иначе
				РабочиеДниГрафика = Новый Соответствие;
			КонецЕсли;
			
			СекундВДне = 86400;
			СтрокаДниОтсутствия.РабочихДней = 0;
			СтрокаДниОтсутствия.РаботалВОбычномРежиме = 0;
			СтрокаДниОтсутствия.РаботалУдаленно = 0;
			СтрокаДниОтсутствия.Отсутствовал = 0;
			ПроверяемаяДата = ПараметрПериод.Значение.ДатаНачала;
			Пока ПроверяемаяДата < ПараметрПериод.Значение.ДатаОкончания Цикл
				
				Если ЗначениеЗаполнено(ГрафикРаботыСотрудника) Тогда
					
					Если РабочиеДниГрафика[ПроверяемаяДата] = Неопределено Тогда
						РабочиеДниГрафика[ПроверяемаяДата] = 
							ГрафикиРаботы.ЭтоРабочийДень(ПроверяемаяДата, ГрафикРаботыСотрудника);
					КонецЕсли;
					ЭтоРабочийДень = РабочиеДниГрафика[ПроверяемаяДата];
					
					Если Не ЭтоРабочийДень Тогда
						ПроверяемаяДата = ПроверяемаяДата + СекундВДне;
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				ЕстьУдаленнаяРабота = Ложь;
				ЕстьОтсутствие = Ложь;
				ТаблицаОтсутствий = Отсутствия.ПолучитьТаблицуОтсутствий(
					НачалоДня(ПроверяемаяДата),
					КонецДня(ПроверяемаяДата),
					Выборка.Сотрудник,
					НастройкиПроверкиОтсутствий);
				Для Каждого ДанныеОтсутствия Из ТаблицаОтсутствий Цикл
					
					Если Не ЗначениеЗаполнено(ДанныеОтсутствия.ВидОтсутствия) Тогда
						ЕстьОтсутствие = Истина;
						Продолжить;
					КонецЕсли;
					
					Если ПризнакиЭтоУдаленнаяРабота[ДанныеОтсутствия.ВидОтсутствия] = Неопределено Тогда
						ПризнакиЭтоУдаленнаяРабота[ДанныеОтсутствия.ВидОтсутствия] =
							ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
								ДанныеОтсутствия.ВидОтсутствия,
								"ЭтоУдаленнаяРабота");
						Если ПризнакиЭтоУдаленнаяРабота[ДанныеОтсутствия.ВидОтсутствия] = Неопределено Тогда
							ПризнакиЭтоУдаленнаяРабота[ДанныеОтсутствия.ВидОтсутствия] = Ложь;
						КонецЕсли;
					КонецЕсли;
					ЭтоУдаленнаяРабота = ПризнакиЭтоУдаленнаяРабота[ДанныеОтсутствия.ВидОтсутствия];
					
					Если ЭтоУдаленнаяРабота Тогда
						ЕстьУдаленнаяРабота = Истина;
					Иначе
						ЕстьОтсутствие = Истина;
					КонецЕсли;
					
				КонецЦикла;
				
				СтрокаДниОтсутствия.РабочихДней = СтрокаДниОтсутствия.РабочихДней + 1;
				Если ЕстьОтсутствие Тогда
					СтрокаДниОтсутствия.Отсутствовал = СтрокаДниОтсутствия.Отсутствовал + 1;
				ИначеЕсли ЕстьУдаленнаяРабота Тогда
					СтрокаДниОтсутствия.РаботалУдаленно = СтрокаДниОтсутствия.РаботалУдаленно + 1;
				Иначе
					СтрокаДниОтсутствия.РаботалВОбычномРежиме = СтрокаДниОтсутствия.РаботалВОбычномРежиме + 1;
				КонецЕсли;
				
				ПроверяемаяДата = ПроверяемаяДата + СекундВДне;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	ВнешниеНаборыДанных = Новый Структура("ДниОтсутствия", ТаблицаДниОтсутствия);
	
	// Процессор компоновки.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	// Вывод результата.
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ОбщегоНазначенияДокументооборот.УстановитьЦветаДиаграмм(ДокументРезультат);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
